{
  "2025-07-21": [
    {
      "title": "Video Summary (Generated)",
      "points": [
        "The AI model could not generate specific points from this video",
        "The transcript was processed but summary generation failed",
        "Check the console logs for more information about the error",
        "You can try again with a shorter video",
        "Or check your OpenAI API key and quota"
      ],
      "summary": "The AI model was unable to generate a proper summary of this video. This could be due to issues with the transcript length, the API key configuration, or rate limits.",
      "video_id": "dQw4w9WgXcQ",
      "url": "https://www.youtube.com/watch?v=dQw4w9WgXcQ"
    }
  ],
  "2025-07-23": [
    {
      "video_id": "US47EpxBVHk",
      "url": "\n        NotifyMe APP 21/7/25, 2:51PM\n        Iman Gadzhi just posted a new video!\n        youtu.be/US47EpxBVHk\n        YouTube\n        Iman Gadzhi\n        Build A One-Person Business As A Beginner (From $0 To $10K)\n        ",
      "title": "Building a Successful One-Person Business with Simplicity and Focus",
      "points": [
        "Focus on unlearning incorrect teachings and simplifying the process",
        "Specificity in targeting the right audience is crucial for successful conversions",
        "Choose the right tools for specific outcomes",
        "Stop making excuses and overthinking it",
        "You already have everything you need to get started"
      ],
      "summary": "The transcript covers essential aspects of building a successful one-person business with simplicity and focus. It emphasizes unlearning incorrect teachings, targeting the right audience, choosing the right tools, and taking action without excuses. The key points stress the profitability of simple ventures, the importance of building assets, and leveraging resources effectively. The speaker encourages viewers to start their entrepreneurial journey by selecting a niche, model, and taking immediate action, promising future gratitude for starting today."
    }
  ]
}